# Множества - set, set() - {}

animals_set = {}  # !!! dict
animals_set = set()
animals_set = {1, 2, 3}

# не хранит дубликаты
# не хранит порядок
# нет возможности обратится к отдельному элементу

nums = [1, 4, 6, 5, 4, 6, 7, 8, 7]
unique_nums = set(nums)  # {1, 4, 6, 5, 7, 8}
nums = list(unique_nums)  # [1, 4, 6, 5, 7, 8]

# Методы

unique_nums.add(10)

# Операции над множествами
s1 = {1, 2, 3}
s2 = {3, 4, 5, 1}

s = s1 | s2  # {1, 2, 3, 4, 5}
# s1.union(s2)

s = s1 & s2  # {1, 3}

s = s1 - s2  # {2}
s = s2 - s1  # {4, 5}

s = (s1 | s2) - s1 & s2  # {2, 4, 5}
